views/verification/index.php

SELECT DISTINCT `term_model` FROM `terminal`
---
                </td>
                <td style="width:30%;">
                    <div style="width:350px;">
                        <?=
                        $form->field($model, 'edcType')->widget(Select2::classname(), [
                            'data' => ArrayHelper::map(Terminal::find()->select(['term_model'])->distinct()->all(), 'term_model', 'term_model'),
                            'options' => [
                                'placeholder' => '-- Pilih Tipe EDC --'
                            ],
                            'pluginOptions' => [
                                'allowClear' => false
                            ],
                        ])->label(false)

SELECT DISTINCT `term_app_version` FROM `terminal`
---
                </td>
                <td style="width:30%;">
                    <div style="width:350px;">
                        <?=
                        $form->field($model, 'appVersion')->widget(Select2::classname(), [
                            'data' => ArrayHelper::map(Terminal::find()->select(['term_app_version'])->distinct()->all(), 'term_app_version', 'term_app_version'),
                            'options' => [
                                'placeholder' => '-- Pilih Versi App --'
                            ],
                            'pluginOptions' => [
                                'allowClear' => false
                            ],
                        ])->label(false)

SELECT `tech_id`, `tech_name` FROM `technician` WHERE `tech_status`='1'
---
            </div>
            <div class="col-lg-6">
                <?= Spinner::widget(['id' => 'spinLoad', 'preset' => 'medium', 'hidden' => true, 'align' => 'right', 'color' => 'green']) ?>
                <?=
                $form->field($model, 'teknisiId')->widget(Select2::classname(), [
                    'data' => ArrayHelper::map(Technician::find()->select(['tech_id', 'tech_name'])->where(['tech_status' => '1'])->all(), 'tech_id', 'tech_name'),
                    'options' => [
                        'placeholder' => '',
                        'onchange' => '$("#spinLoad").removeClass("kv-hide");$.post( "' . Yii::$app->urlManager->createUrl('verification/gettechnician?id=') . '"+$(this).val(), function( data ) {var str = data.split("|");$("#techNip").val(str[0]);$("#techId").val(str[1]);$("#techCompany").val(str[2]);$("#spinLoad").addClass("kv-hide");});'
                    ],
                    'pluginOptions' => [
                        'allowClear' => false
                    ],
                ])->label('Teknisi')