controllers/SiteController.php

    public function actionIndex() { //NOSONAR
        if (isset(Yii::$app->user->identity)) {
            switch (Yii::$app->user->identity->user_privileges) {
                case 'ADMIN':
                case 'OPERATOR':
                    $dashboardType = 1;
                    break;
                case 'TMS ADMIN':
                case 'TMS SUPERVISOR':
                case 'TMS OPERATOR':
                    $dashboardType = 2;
                    break;
                default:
                    $dashboardType = 0;
            }
            if ($dashboardType == 1) {
                $syncTerminal = SyncTerminal::find()->select('sync_term_created_time')->orderBy(['sync_term_created_time' => SORT_DESC])->one();
                if ($syncTerminal instanceof SyncTerminal) {
                    $lastSync = $syncTerminal->sync_term_created_time;
                } else {
                    $lastSync = '';
                }
                $totalTerminal = Terminal::find()->select('term_serial_num')->count();
                $totalVerifikasi = VerificationReport::find()->select('vfi_rpt_term_serial_num')->distinct()->count();
                $totalTechnician = Technician::find()->where(['tech_status' => '1'])->count();
---
SELECT `sync_term_created_time` FROM `sync_terminal` ORDER BY `sync_term_created_time` DESC
SELECT COUNT(*) FROM `terminal`
SELECT COUNT(*) FROM (SELECT DISTINCT `vfi_rpt_term_serial_num` FROM `verification_report`) `c`
SELECT COUNT(*) FROM `technician` WHERE `tech_status`='1'