controllers/UserController.php

    public function actionLogin() {
        $this->layout = 'main-login';
        if (!Yii::$app->getUser()->isGuest) {
            return $this->redirect(['site/index']);
        }

        $model = new Login();
        if ($model->load(Yii::$app->getRequest()->post()) && $model->login()) {
            if (isset(Yii::$app->user->identity)) {
                Yii::$app->user->identity->tms_session = null;
                Yii::$app->user->identity->tms_password = TmsHelper::encrypt_decrypt($model->password);
                Yii::$app->user->identity->save();
            }
            ActivityLogHelper::add(ActivityLogHelper::LOGIN_ACTIVITY);
            return $this->redirect(['site/index']);
        } else {
            $appType = '';
            if (!empty($model->username)) {
                $userLogin = \app\models\User::find()->where(['user_name' => $model->username])->one();
---
SELECT * FROM `user` WHERE `user_name`='Muhammad.Adiyawar@cimbniaga.co.id'

    public function actionGetapptype($username) {
        $appTypeTitle = '';
        $userLogin = \app\models\User::find()->where(['user_name' => $username])->one();
---
SELECT * FROM `user` WHERE `user_name`='irmap1@verifone.com'