controllers/VerificationController.php

SELECT * FROM `terminal` WHERE (`term_serial_num`='TESTDEV1') AND (`term_model`='X990') AND (`term_app_version`='3.0.3')
---
    public function actionIndex() { //NOSONAR
        $model = new Verification();
        $model->scenario = $model::SCENARIO_VALIDATE_SEARCH;

        if (Yii::$app->request->isPost) {
            if ($model->load(Yii::$app->request->post())) {
                $terminal = Terminal::find()->where([
                            'term_serial_num' => $model->csi,
                            'term_model' => $model->edcType,
                            'term_app_version' => $model->appVersion
                        ])->one();