models/User.php

    public static function findIdentity($id) {
        return static::findOne(['user_id' => $id, 'status' => UserStatus::ACTIVE]);
---
SELECT * FROM `user` WHERE (`user_id`=41) AND (`status`=10)

    public static function findByUsername($user_name) {
        return static::findOne(['user_name' => $user_name, 'status' => UserStatus::ACTIVE]);
---
SELECT * FROM `user` WHERE (`user_name`='irmap1@verifone.com') AND (`status`=10)